sdaiNext(Sdai_ItrId*)
\details
Moves the position of a specified iterator to the next element in the aggregate instance.
\param iterator [in] An iterator to set the position.
\returns sdaiTRUE if the next element exists and became the current; otherwise, the function returns sdaiFALSE.